README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-23 seg 22:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Compilador</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lucas Martins Soares" />
</head>
<body>
<div id="content">
<h1 class="title">Compilador</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4d93962">Link do Repositório</a></li>
<li><a href="#orgc461253">Como executar</a></li>
<li><a href="#orgff2ecf1">Como funciona</a></li>
</ul>
</div>
</div>
<p>
Compilador escrito em Haskell para a disciplina de compiladores.
</p>

<div id="outline-container-org4d93962" class="outline-2">
<h2 id="org4d93962">Link do Repositório</h2>
<div class="outline-text-2" id="text-org4d93962">
<p>
<a href="https://github.com/lucasmsoares96/Compilador">https://github.com/lucasmsoares96/Compilador</a>
</p>
</div>
</div>

<div id="outline-container-orgc461253" class="outline-2">
<h2 id="orgc461253">Como executar</h2>
<div class="outline-text-2" id="text-orgc461253">
<p>
Nesse repositório se encontra os binários pre-compilados para linux (sem extensão) e para windows (.exe) na arquitetura x86. Para executar o binário pre-compilado, basta digitar o seguinte comando:
</p>

<ul class="org-ul">
<li>Linux</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">cd build
./Compilador
</pre>
</div>

<ul class="org-ul">
<li>Windows</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">cd build
"Compilador.exe"
</pre>
</div>

<p>
Caso deseje executar o programa em outra arquitetura, será necessário recompilar o código. Para isso é preciso ter um ambinete haskell instalado e configurado nas suas maquina. A forma recomendada de instalação é através do <a href="https://www.haskell.org/ghcup/">GHCup</a>. Em seguida execute o seguinte comando.
</p>

<div class="org-src-container">
<pre class="src src-bash">cabal run
</pre>
</div>

<p>
O comando acima compila e executa o programa em Haskell.
</p>
</div>
</div>

<div id="outline-container-orgff2ecf1" class="outline-2">
<h2 id="orgff2ecf1">Como funciona</h2>
<div class="outline-text-2" id="text-orgff2ecf1">
<p>
Um compilador é uma ferramento capaz de traduzir o código de uma linguagem de programação para outra linguagem. Esse compilador converte um código na linguagem C para o correspondente na linguagem Python.
</p>

<p>
A compilação possui 6 etapas:
</p>
<ol class="org-ol">
<li>Análise Lexica</li>
<li>Análise Sintática</li>
<li>Análise Semântica</li>
<li>Geração de Código Intermediário</li>
<li>Otimização do Código</li>
<li>Geração do Código Final</li>
</ol>

<p>
Atualmente este compilador está na sua segunda etapa (Análise Sintática)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas Martins Soares</p>
<p class="date">Created: 2022-05-23 seg 22:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
